// AnimBlueprintGeneratedClass BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C
// Size: 0x2bc0 (Inherited: 0x690)
struct UBP_Anim_CaptainScott_Base_C : UNPCAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x690(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_2CD902C24C5DD3C39E917B945B6173A8; // 0x698(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_501CBE584F221B63A5C652AFAD438A7A; // 0x6e0(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_61ACD28F4CA54F78F664D79BFB91AA16; // 0x728(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B7D7BFE443C78A4DB09BF2954F9FB2A7; // 0x770(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1590FC9B424009158EB4CD81148B9C41; // 0x7b0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3F28B3CF423C1190623B60A13F607335; // 0x7f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43F9A72248609D19E5705EA6BAB1F30C; // 0x830(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87E5518C4493614D709ADCBB10100CF5; // 0x870(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_AFE99B244EDF78E44038A687CE9DACD7; // 0x8b0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7C8989714AD1ACE3E3E052B27235B0BB; // 0x8f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8A25DCAC47B44029B70F88AF3F5A5C54; // 0x930(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_675DEA224ECE4ACEFF2CD7ABF821CC09; // 0x970(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C46244E8427204CD971229B144F2AF76; // 0x9b0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1EF443394F6694B17EAA6696267E41CF; // 0x9f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_DD576A534C483A283A935D80FFA30FAA; // 0xa30(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E762889E42FF3893B5EC47AC0F83B559; // 0xa70(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C233A5254D84C1FBAE3AB58DF644A6B9; // 0xab0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_D110FA9C4F48AD499E63039810EAEEF4; // 0xaf0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6E2162FF4AC6F423929D6981B69ADC57; // 0xb30(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6DA47D5148C4CDFCB5E5628102D25583; // 0xb70(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_636ED5134330EA5E472DE491FF206203; // 0xbb0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39E0731744E45AFE1A647FB3AB9A2012; // 0xbf0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8AB75B0A4E5B13BBA897D583D0DF7A50; // 0xc30(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C57525264E32B0A0AAF5EE9ECB93E2A5; // 0xc70(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4610264341D118917106CD823FFFF791; // 0xcb0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_714CC7C5431B83F296B000B20B669607; // 0xcf0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30C5D665441234F12947C383078A8A68; // 0xd30(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15761CF04E964C041AB00CBAEF8151F0; // 0xd70(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F745863A43BD24C6D469ADB62F2DCCEA; // 0xdb0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84433A844303C3523C9CB18CF185EA51; // 0xdf0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B26560374147BD1FF497FA98EFD1F5EF; // 0xe30(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_820ACE124005626739425B809FACBDF4; // 0xe70(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_DA023A294811C9D278D08F92910F646B; // 0xed0(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83732BD54FE6FBAF9B324A8F73EBE5EF; // 0xf18(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_43F7188D491C4A05C484A6BB1454208C; // 0xf78(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2BD56B32452C7EBD325D0F80F10961A5; // 0xfc0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_CF0CE82B43ED02B5D4DE33B127034E18; // 0x1020(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_07D2E30146FDA2259F26F3B39F1221BC; // 0x1068(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A3258A6E475175DA5E5D5EAEB7FA8DD2; // 0x10a8(0x40)
	struct FAnimNode_Root AnimGraphNode_StateResult_994E3755478BD24BF35FA29984048D95; // 0x10e8(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_A1A96C8F4FA0C88004FEA9B193BBC6D7; // 0x1130(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_269309D3407497D6420FD886C69BE95B; // 0x1190(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_0502F6954CD4F84885DE03B203FAA8F6; // 0x11d8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_B18FE85B4ADCBEAB2174A7857612C92D; // 0x1238(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_341236BF4A81EBAA5A49EDB86EC42020; // 0x1280(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_674A6619431A6BBD4596DABD67671419; // 0x1328(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1DFB56E349429EAE648DCB8577FE7359; // 0x1370(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_86A6275B4A5BA192F44B0FA218DF6A6A; // 0x13d0(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_09CEE3C24178A5605CCF648191962615; // 0x1418(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A291661E44C69BA0E4EF43964E4A6942; // 0x1458(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_C847221C47174F2EB5537E830D340172; // 0x1498(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_6673CFE14C2EE62CCE3294A742F35812; // 0x14f8(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9BDDC1784A786667F076899525374D5B; // 0x1540(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_4F05CBB143B076B163966AA6906E1FB9; // 0x15a0(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_D238362B487C43917B613DBA962EEC64; // 0x15e8(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_B40EA37F4A864F9446DE8997ECE0B8F5; // 0x1690(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7A16BCAE43C41D8BAFB0BF8D05B0ABF1; // 0x16d8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_AC3CBAAC4C827FD479924A86438256D2; // 0x1738(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_BC0AAFE64F928C6D83C3CD845DE4392F; // 0x1780(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_AEFCE8034CC275366AE4CDA1DE42244B; // 0x17c0(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39CF6ACE4B49135D300212AF6CD8574C; // 0x1800(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_D77106F5421C70FDBB57609104AB457F; // 0x1860(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_09547AC4474E920370C08B9CCA7EDEFA; // 0x18a8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_DBBA67C647C2061BFA1797AFE9BF99E0; // 0x1908(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4015BE5C46E0BF7E41E53C9658B209E1; // 0x1950(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_8354546645EA8B119354CEA64CC8BDC0; // 0x19f8(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_1C81DEF947DCD048E856BA89D9EB2426; // 0x1a40(0xa8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24991954444F19A213E58B8DC6CF9505; // 0x1ae8(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_54B77A6F494C7E192928C6A04D63A294; // 0x1b98(0x60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_782FC44A4BA050844B1E08A3CF584C1D; // 0x1bf8(0xb0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_82B1100244DADFF3445C41BD2C2627EC; // 0x1ca8(0x70)
	struct FAnimNode_Slot AnimGraphNode_Slot_C87D1D604B3866AD395251BB86701BC1; // 0x1d18(0x60)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose_B0BB37374633BDD4F923679649B531B4; // 0x1d78(0x38)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_D301208C468DE0860DE1BD931CA2CCEB; // 0x1db0(0x90)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_943177854BEF4E336470CCAA758E8367; // 0x1e40(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_860F348747CFCD9E6CD7D8AD530A6BA6; // 0x1ef0(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4458DC0C4876AFE7F47F01A4B3EE64F9; // 0x1f38(0x90)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8F84B4D74ADE646FBD60DD91B35E43A5; // 0x1fc8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7D5AF0BA4B2BF4691EAFAB9A1FEDBE19; // 0x2010(0x48)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose_EE9EBDFC4FAF4489CC6414907A29A0C7; // 0x2058(0x38)
	struct FAnimNode_Slot AnimGraphNode_Slot_5539331E4F2F8789177120BC4298A37E; // 0x2090(0x60)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_40EE09364CBF9F1B6514C2BF3C74DDA5; // 0x20f0(0x70)
	struct FAnimNode_LookAt AnimGraphNode_LookAt_96FB33B943BE924F22D4CE91913E09BA; // 0x2160(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_8D47F06140EF28269D342693F64D5138; // 0x2220(0x60)
	struct FAnimationNode_TwoWayBlend AnimGraphNode_TwoWayBlend_DC8E73264068DAAC4BA234B87217505B; // 0x2280(0x70)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8D29F36546937AF8ECE06C9A73649AB5; // 0x22f0(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_C38A3C1E41471AD7EA3E3B96276A997B; // 0x2338(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_15168AEB4BF9E41F3C75318CF6C11682; // 0x2380(0x60)
	struct FAnimationNode_TwoWayBlend AnimGraphNode_TwoWayBlend_E4A556274698A1BD643F508807EE1643; // 0x23e0(0x70)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_D5E19CB94C98D23F96F595B9C04E6A92; // 0x2450(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_F2AAB046408E6CA0AA0B29936B85516A; // 0x24f0(0x60)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_E52554C84B10A6449FBB97850C2BE50C; // 0x2550(0x90)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_0D963207499A7822FBB178A026D624AE; // 0x25e0(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3161F6C345092E9E40FC94A517E831D7; // 0x2628(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_313BE00E4C71172584AA9A923DED4166; // 0x2688(0x60)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_987640204F2F7E4373BF48A0ED95F6F6; // 0x26e8(0x50)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_D617ED194736E8F11C6FAA810C498F5E; // 0x2738(0x90)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4DCAA68C4014B93486B393A06B88E875; // 0x27c8(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_0EE933D14C69F43ABE6B2189B20B6EAE; // 0x2810(0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_11A583A44A391F3B21831087C0A45F0C; // 0x2858(0x70)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1E8D3B034D8FCE8D9A1CA78A5C3EDC2B; // 0x28c8(0x60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_85DF0F4A44D5267A66881584130AA9BE; // 0x2928(0xb0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_E87CAC38462EB2263F5999B9F62A32FA; // 0x29d8(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_EAB7F21F43B791E0C2C11F915D5D7B23; // 0x2a78(0x90)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_010DCEBC43D3CB2CA74A818FE8151304; // 0x2b08(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_FB57BE024BB219386DF7A6A3F1CFAFCA; // 0x2b50(0x48)
	bool AnimgraphStarted; // 0x2b98(0x01)
	bool IsPhased; // 0x2b99(0x01)
	bool ManualHeadLookAt; // 0x2b9a(0x01)
	bool Is Playing Sequencer Anim; // 0x2b9b(0x01)
	float SequencerBlendWeight; // 0x2b9c(0x04)
	float AnimationBlendWeight; // 0x2ba0(0x04)
	float FacialOverride; // 0x2ba4(0x04)
	float LookAtActivationSpeed; // 0x2ba8(0x04)
	float LookAtTargetPositionSpeed; // 0x2bac(0x04)
	float Look At Clamp; // 0x2bb0(0x04)
	float HeadRotationX; // 0x2bb4(0x04)
	float HeadRotationY; // 0x2bb8(0x04)
	float HeadRotationZ; // 0x2bbc(0x04)

	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_B7D7BFE443C78A4DB09BF2954F9FB2A7(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_B7D7BFE443C78A4DB09BF2954F9FB2A7 // BlueprintEvent // @ game+0x190d0a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_1590FC9B424009158EB4CD81148B9C41(); // Function BP_Anim_CaptainScott_Base.BP_Anim_CaptainScott_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_CaptainScott_Base_AnimGraphNode_TransitionResult_1590FC9B424009158EB4CD81148B9C41 // BlueprintEvent // @ game+0x190d0a0
